# Тема "переменные"
# 1. Напишите 4 переменные

homework = 12
time = 1.5
course = 'Python'
time_to_complete_one_homework = homework/(time * 60)

# 2. Отобразить переменные в контексте

print(f"{course}, всего задач:{homework}, затрачено часов:{time}, среднее время выполнения:{time_to_complete_one_homework}")