# Тема "динамическая типизация"

# 1. Создать переменные разных типов

name = "Никита"
print(f'Мое имя = {name}')

age = 22
print(f'Мой возраст = {age}')

age = 22 + 1
print(f'Я постарел, теперь мой возраст = {age}')

is_student = True
print(f"Я студент? = {is_student}")